; domain
(define (domain logistics)
  (:requirements :strips :typing)
  (:types city location physobj vehicle package airport)
  (:predicates
    (loc ?l - location ?c - city)
    (at ?x - physobj ?l - location)
    (in ?p - package ?v - vehicle)
  )

  (:action load
    :parameters (?p - package ?v - vehicle ?l - location)
    :precondition (and (at ?p ?l) (at ?v ?l))
    :effect (and (not (at ?p ?l)) (in ?p ?v))
  )

  (:action unload
    :parameters (?p - package ?v - vehicle ?l - location)
    :precondition (and (in ?p ?v) (at ?v ?l))
    :effect (and (not (in ?p ?v)) (at ?p ?l))
  )

  (:action drive
    :parameters (?v - vehicle ?from - location ?to - location ?c - city)
    :precondition (and (at ?v ?from) (loc ?from ?c) (loc ?to ?c))
    :effect (and (not (at ?v ?from)) (at ?v ?to))
  )

  (:action fly
    :parameters (?v - vehicle ?from - location ?to - location)
    :precondition (at ?v ?from)
    :effect (and (not (at ?v ?from)) (at ?v ?to))
  )
)

; problem
(define (problem logistics-3)
  (:domain logistics)
  (:objects
    pkg1 pkg2 pkg3 - object
    truck1 truck2 - truck
    plane1 - airplane
    loc1 loc2 - location
    airport1 airport2 - airport
    city1 city2 - city
  )
  (:init
    (loc loc1 city1)
    (loc airport1 city1)
    (loc loc2 city2)
    (loc airport2 city2)
    (at truck1 loc1)
    (at truck2 loc2)
    (at plane1 airport1)
    (at pkg1 loc1)
    (at pkg2 airport1)
    (at pkg3 airport2)
  )
  (:goal (and (at pkg1 loc2) (at pkg2 airport2) (at pkg3 loc1)))
)

; plan
1. (load pkg1 truck1 loc1)
   deleted: (at pkg1 loc1)
   added: (in pkg1 truck1)
   goals met: 0 of 3
2. (load pkg2 plane1 airport1)
   deleted: (at pkg2 airport1)
   added: (in pkg2 plane1)
   goals met: 0 of 3
3. (drive truck1 loc1 airport1 city1)
   deleted: (at truck1 loc1)
   added: (at truck1 airport1)
   goals met: 0 of 3
4. (unload pkg1 truck1 airport1)
   deleted: (in pkg1 truck1)
   added: (at pkg1 airport1)
   goals met: 0 of 3
5. (load pkg1 plane1 airport1)
   deleted: (at pkg1 airport1)
   added: (in pkg1 plane1)
   goals met: 0 of 3
6. (fly plane1 airport1 airport2)
   deleted: (at plane1 airport1)
   added: (at plane1 airport2)
   goals met: 0 of 3
7. (load pkg3 plane1 airport2)
   deleted: (at pkg3 airport2)
   added: (in pkg3 plane1)
   goals met: 0 of 3
8. (unload pkg2 plane1 airport2)
   deleted: (in pkg2 plane1)
   added: (at pkg2 airport2)
   goals met: 1 of 3
9. (unload pkg1 plane1 airport2)
   deleted: (in pkg1 plane1)
   added: (at pkg1 airport2)
   goals met: 1 of 3
10. (fly plane1 airport2 airport1)
   deleted: (at plane1 airport2)
   added: (at plane1 airport1)
   goals met: 1 of 3
11. (unload pkg3 plane1 airport1)
   deleted: (in pkg3 plane1)
   added: (at pkg3 airport1)
   goals met: 1 of 3
12. (load pkg3 truck1 airport1)
   deleted: (at pkg3 airport1)
   added: (in pkg3 truck1)
   goals met: 1 of 3
13. (drive truck1 airport1 loc1 city1)
   deleted: (at truck1 airport1)
   added: (at truck1 loc1)
   goals met: 1 of 3
14. (unload pkg3 truck1 loc1)
   deleted: (in pkg3 truck1)
   added: (at pkg3 loc1)
   goals met: 2 of 3
15. (drive truck2 loc2 airport2 city2)
   deleted: (at truck2 loc2)
   added: (at truck2 airport2)
   goals met: 2 of 3
16. (load pkg1 truck2 airport2)
   deleted: (at pkg1 airport2)
   added: (in pkg1 truck2)
   goals met: 2 of 3
17. (drive truck2 airport2 loc2 city2)
   deleted: (at truck2 airport2)
   added: (at truck2 loc2)
   goals met: 2 of 3
18. (unload pkg1 truck2 loc2)
   deleted: (in pkg1 truck2)
   added: (at pkg1 loc2)
   goals met: 3 of 3
